Revit 2018 API
HorizontalTextAlignment Enumeration
 Supported kinds of text horizontal alignment within the text containing box.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2016
Since: 2016
Syntax
C#
public enum HorizontalTextAlignment
Visual Basic
Public Enumeration HorizontalTextAlignment
Visual C++
public enum class HorizontalTextAlignment
Members
Member name | Description
Left |  Text is aligned on the left side of the text box.
Right |  Text is aligned on the righ side of the text box.
Center |  Text is centered within the text box.
See Also
Autodesk.Revit.DB Namespace